IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28003x_xbar_regs.xml
<module id="XBAR_REGS" HW_revision="" description="XBAR Registers">
	<register id="XBARFLG1" width="32" page="1" offset="0x0" internal="0" description="X-Bar Input Flag Register 1">
		<bitfield id="CMPSS1_CTRIPL" description="Input Flag for CMPSS1.CTRIPL Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CMPSS1_CTRIPH" description="Input Flag for CMPSS1.CTRIPH Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPL" description="Input Flag for CMPSS2.CTRIPL Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPH" description="Input Flag for CMPSS2.CTRIPH Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPL" description="Input Flag for CMPSS3.CTRIPL Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPH" description="Input Flag for CMPSS3.CTRIPH Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPL" description="Input Flag for CMPSS4.CTRIPL Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPH" description="Input Flag for CMPSS4.CTRIPH Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="CMPSS1_CTRIPOUTL" description="Input Flag for CMPSS1.CTRIPOUTL Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CMPSS1_CTRIPOUTH" description="Input Flag for CMPSS1.CTRIPOUTH Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPOUTL" description="Input Flag for CMPSS2.CTRIPOUTL Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CMPSS2_CTRIPOUTH" description="Input Flag for CMPSS2.CTRIPOUTH Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPOUTL" description="Input Flag for CMPSS3.CTRIPOUTL Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CMPSS3_CTRIPOUTH" description="Input Flag for CMPSS3.CTRIPOUTH Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPOUTL" description="Input Flag for CMPSS4.CTRIPOUTL Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CMPSS4_CTRIPOUTH" description="Input Flag for CMPSS4.CTRIPOUTH Signal" begin="23" end="23" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG2" width="32" page="1" offset="0x2" internal="0" description="X-Bar Input Flag Register 2">
		<bitfield id="INPUT1" description="Input Flag for INPUT1 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="INPUT2" description="Input Flag for INPUT2 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="INPUT3" description="Input Flag for INPUT3 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="INPUT4" description="Input Flag for INPUT4 Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="INPUT5" description="Input Flag for INPUT5 Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="INPUT6" description="Input Flag for INPUT6 Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="ADCSOCA" description="Input Flag for ADCSOCA Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="ADCSOCB" description="Input Flag for ADCSOCB Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="INPUT7" description="Input Flag for INPUT7 Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="INPUT8" description="Input Flag for INPUT8 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="INPUT9" description="Input Flag for INPUT9 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="INPUT10" description="Input Flag for INPUT10\ Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="INPUT11" description="Input Flag for INPUT11 Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="INPUT12" description="Input Flag for INPUT12 Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="INPUT13" description="Input Flag for INPUT13 Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="INPUT14" description="Input Flag for INPUT14 Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="ECAP1_OUT" description="Input Flag for ECAP1.OUT Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="ECAP2_OUT" description="Input Flag for ECAP2.OUT Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="ECAP3_OUT" description="Input Flag for ECAP3.OUT Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXTSYNCOUT" description="Input Flag for EXTSYNCOUT Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT1" description="Input Flag for ADCAEVT1 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT2" description="Input Flag for ADCAEVT2 Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT3" description="Input Flag for ADCAEVT3 Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="ADCAEVT4" description="Input Flag for ADCAEVT4 Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT1" description="Input Flag for ADCBEVT1 Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT2" description="Input Flag for ADCBEVT2 Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT3" description="Input Flag for ADCBEVT3 Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="ADCBEVT4" description="Input Flag for ADCBEVT4 Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT1" description="Input Flag for ADCCEVT1 Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG3" width="32" page="1" offset="0x4" internal="0" description="X-Bar Input Flag Register 3">
		<bitfield id="ADCCEVT2" description="Input Flag for ADCCEVT2 Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT3" description="Input Flag for ADCCEVT3 Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="ADCCEVT4" description="Input Flag for ADCCEVT4 Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPL" description="Input Flag for SD1FLT1.COMPL Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPH" description="Input Flag for SD1FLT1.COMPH Signal" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPL" description="Input Flag for SD1FLT2.COMPL Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPH" description="Input Flag for SD1FLT2.COMPH Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPL" description="Input Flag for SD1FLT3.COMPL Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPH" description="Input Flag for SD1FLT3.COMPH Signal" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPL" description="Input Flag for SD1FLT4.COMPL Signal" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPH" description="Input Flag for SD1FLT4.COMPH Signal" begin="14" end="14" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPL" description="Input Flag for SD2FLT1.COMPL Signal" begin="15" end="15" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_COMPH" description="Input Flag for SD2FLT1.COMPH Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPL" description="Input Flag for SD2FLT2.COMPL Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPH" description="Input Flag for SD2FLT2.COMPH Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPL" description="Input Flag for SD2FLT3.COMPL Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPH" description="Input Flag for SD2FLT3.COMPH Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPL" description="Input Flag for SD2FLT4.COMPL Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPH" description="Input Flag for SD2FLT4.COMPH Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_COMPZ" description="Input Flag for SD1FLT1.COMPZ Signal" begin="24" end="24" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT1_DRINT" description="Input Flag for SD1FLT1.DRINT Signal" begin="25" end="25" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_COMPZ" description="Input Flag for SD1FLT2.COMPZ Signal" begin="26" end="26" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT2_DRINT" description="Input Flag for SD1FLT2.DRINT Signal" begin="27" end="27" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_COMPZ" description="Input Flag for SD1FLT3.COMPZ Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT3_DRINT" description="Input Flag for SD1FLT3.DRINT Signal" begin="29" end="29" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_COMPZ" description="Input Flag for SD1FLT4.COMPZ Signal" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="SD1FLT4_DRINT" description="Input Flag for SD1FLT4.DRINT Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARFLG4" width="32" page="1" offset="0x6" internal="0" description="X-Bar Input Flag Register 4">
		<bitfield id="SD2FLT1_COMPZ" description="Input Flag for SD2FLT1.COMPZ Signal" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT1_DRINT" description="Input Flag for SD2FLT1.DRINT Signal" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_COMPZ" description="Input Flag for SD2FLT2.COMPZ Signal" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT2_DRINT" description="Input Flag for SD2FLT2.DRINT Signal" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_COMPZ" description="Input Flag for SD2FLT3.COMPZ Signal" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT3_DRINT" description="Input Flag for SD2FLT3.DRINT Signal" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_COMPZ" description="Input Flag for SD2FLT4.COMPZ Signal" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="SD2FLT4_DRINT" description="Input Flag for SD2FLT4.DRINT Signal" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT0" description="Input Flag for MCANA_FEVT0 Signal" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT1" description="Input Flag for MCANA_FEVT1 Signal" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="MCANA_FEVT2" description="Input Flag for MCANA_FEVT2 Signal" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="CLB1_4_1" description="Input Flag for CLB1_4.1 Signal" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="CLB1_5_1" description="Input Flag for CLB1_5.1 Signal" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="CLB2_4_1" description="Input Flag for CLB2_4.1 Signal" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="CLB2_5_1" description="Input Flag for CLB2_5.1 Signal" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="CLB3_4_1" description="Input Flag for CLB3_4.1 Signal" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="CLB3_5_1" description="Input Flag for CLB3_5.1 Signal" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="CLB4_4_1" description="Input Flag for CLB4_4.1 Signal" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="CLB4_5_1" description="Input Flag for CLB4_5.1 Signal" begin="23" end="23" width="1" rwaccess="R"/>
		<bitfield id="ERRORSTS_ERROR" description="Input Latch for ERRORSTS_ERROR Signal" begin="28" end="28" width="1" rwaccess="R"/>
		<bitfield id="CLAHALT" description="Input Flag for CLAHALT Signal" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="XBARCLR1" width="32" page="1" offset="0x8" internal="0" description="X-Bar Input Flag Clear Register 1">
		<bitfield id="CMPSS1_CTRIPL" description="Input Flag Clear for CMPSS1.CTRIPL Signal" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPH" description="Input Flag Clear for CMPSS1.CTRIPH Signal" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPL" description="Input Flag Clear for CMPSS2.CTRIPL Signal" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPH" description="Input Flag Clear for CMPSS2.CTRIPH Signal" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPL" description="Input Flag Clear for CMPSS3.CTRIPL Signal" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPH" description="Input Flag Clear for CMPSS3.CTRIPH Signal" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPL" description="Input Flag Clear for CMPSS4.CTRIPL Signal" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPH" description="Input Flag Clear for CMPSS4.CTRIPH Signal" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPOUTL" description="Input Flag Clear for CMPSS1.CTRIPOUTL Signal" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS1_CTRIPOUTH" description="Input Flag Clear for CMPSS1.CTRIPOUTH Signal" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTL" description="Input Flag Clear for CMPSS2.CTRIPOUTL Signal" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2_CTRIPOUTH" description="Input Flag Clear for CMPSS2.CTRIPOUTH Signal" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTL" description="Input Flag Clear for CMPSS3.CTRIPOUTL Signal" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3_CTRIPOUTH" description="Input Flag Clear for CMPSS3.CTRIPOUTH Signal" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTL" description="Input Flag Clear for CMPSS4.CTRIPOUTL Signal" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4_CTRIPOUTH" description="Input Flag Clear for CMPSS4.CTRIPOUTH Signal" begin="23" end="23" width="1" rwaccess="RW"/>
	</register>
